app/controllers/api/users_controller.rb

		def index
			users = User.all
---
SELECT `users`.* FROM `users`